#coding=UTF-8

import random

events = [{'立志创新，梦想起航':'1999'}
		, {'百度创立':'2000'}
		, {'获得第二笔融资1000万美元':'2000'}
		, {'推出独立搜索引擎':'2001'}
		, {'百度MP3搜索上线':'2002'}
		, {'百度贴吧上线':'2003'}
		, {'中国网民首选搜索引擎':'2004'}
		, {'推出百度WAP搜索':'2004'}
		, {'百度知道上线':'2005'}
		, {'百度地图上线':'2005'}
		, {'美国纳斯达克上市':'2005'}
		, {'百度百科上线':'2006'}
		, {'百度视频正式上线':'2007'}
		, {'启动阿拉丁计划':'2008'}
		, {'推出框计算':'2009'}
		, {'百度文库上线':'2009'}
		, {'完成凤巢切换':'2010'}
		, {'创立爱奇艺':'2010'}
		, {'搜索市场份额创新高':'2011'}
		, {'百度网盘上线':'2012'}
		, {'建立深度学习研究院':'2013'}
		, {'美国研发中心成立':'2014'}
		, {'发布机器人助理度秘':'2015'}
		, {'发布百度大脑PanddlePanddle':'2016'}
		, {'推出百家号和信息流':'2016'}
		, {'发布ABC智能云战略':'2016'}
		, {'推出Appollo自动驾驶平台':'2017'}
		, {'智能小程序发布':'2018'}
		, {'成为中国人工智能专利申请第一':'2019'}
		, {'百度用户规模超10亿':'2019'}
		, {'继续征途':'2020'}]

random.shuffle(events)

for event in events:
	for key, value in event.items():
		answer = input(f"\n{key}\n")
		if answer == value:
			print("right")
		else:
			print(f"wrong!the right answer is {value}")